Config/Reports/ИнвентарнаяКарточка61н.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ИнвентарнаяКарточка61н</Name>
		</Properties>
	</Report>
</MetaDataObject>

Config/Catalogs/ОсновныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОсновныеСредства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНФА</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНФА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНФА</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНФА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКОФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизационнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрупповойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФАИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожетСодержатьДрагМатериалы</Name>
					<Comment>Содержание драг. материалов будет определено после списания и утилизации.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзготовительОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмуществоКазны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументацияЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументацияЭкземпляров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОК01394</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодПоОКОФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрослеживаемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоКТРУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМаркируемойПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркируемойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЕКПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиныйКодификаторПредметовСнабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйНомерОбъектаКапвложенийДоПоступления</Name>
					<Comment>Учетный номер объекта капвложений до поступления в учреждение</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDНоменклатурыОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКонтураИдентификацииСведенийОбОбъекте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзменениеПравообладанияОбременения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПраваОбременения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Правообладания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПрава</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияПрослеживаемости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрослеживаемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Reports/ИнвентарнаяКарточка61н/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Задать настройки формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//         - Неопределено
//   КлючВарианта - Строка
//                - Неопределено
//   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.РазрешеноИзменятьСтруктуру = Ложь;
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПередЗагрузкойВариантаНаСервере    = Истина; 
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПриСозданииНаСервере.
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	// Если есть контекст, определим его для установки параметров СКД при контекстном вызове отчета.
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ЭтоКонтекстныйВызов", Ложь);
	ДанныеДокумента = Неопределено;
	Объекты = Неопределено;
	Если Форма.Параметры.Свойство("ПараметрКоманды", Объекты)
		И ЗначениеЗаполнено(Объекты) Тогда 
		
		Если ТипЗнч(Объекты) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(Объекты);
			
		ИначеЕсли ТипЗнч(Объекты) = Тип("Массив") 
			И Объекты.Количество() <> 0 
			И ТипЗнч(Объекты[0]) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			МассивОбъектов = Объекты;
			
		ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объекты))
			ИЛИ (ТипЗнч(Объекты) = Тип("Массив") 
			И Объекты.Количество() = 1 
			И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объекты[0]))) Тогда
			
			ДанныеДокумента = СтруктураДанныхДокумента();
			ДанныеДокумента(Объекты, ДанныеДокумента);
			МассивОбъектов = ДанныеДокумента.Объекты;
			
		ИначеЕсли ТипЗнч(Объекты) = Тип("Массив") 
			И Объекты.Количество() > 1 
			И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объекты[0])) Тогда
			ТекстСообщения = НСтр("ru = 'Инвентарные карточки объектов можно сформировать только по одному документу.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;	
		
		ПараметрОбъектыНФА = Новый Структура("ОбъектыНФА", Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(МассивОбъектов));
		Отчеты.ИнвентарнаяКарточка61н.УстановитьПараметрыДанных(КомпоновщикНастроек.Настройки, ПараметрОбъектыНФА);   
		КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ЭтоКонтекстныйВызов", Истина);
	КонецЕсли;  
	
	// Период получения данных.
	Период = Неопределено;
	Если ДанныеДокумента <> Неопределено И ЗначениеЗаполнено(ДанныеДокумента.Дата) Тогда       
		// Данные передаются из контекста
		ПараметрПериод = Новый Структура("Период", Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(КонецДня(ДанныеДокумента.Дата)));
		
	ИначеЕсли Форма.Параметры.Свойство("Период", Период)
		И ЗначениеЗаполнено(Период) Тогда 
		ПараметрПериод = Новый Структура("Период", Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(КонецДня(Период)));
		
	Иначе
		ПараметрПериод = Новый Структура(
			"Период", Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(КонецДня(ОбщегоНазначенияБГУ.РабочаяДатаПользователя())));
	КонецЕсли;
	Отчеты.ИнвентарнаяКарточка61н.УстановитьПараметрыДанных(КомпоновщикНастроек.Настройки, ПараметрПериод);   
	
	// Организация.
	Организация = Неопределено;
	Если ДанныеДокумента <> Неопределено И ЗначениеЗаполнено(ДанныеДокумента.Организация) Тогда       
		// Данные передаются из контекста
		ПараметрОрганизация = Новый Структура("Организация", Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(ДанныеДокумента.Организация));
		
	ИначеЕсли Форма.Параметры.Свойство("Организация", Организация)
		И ЗначениеЗаполнено(Организация) Тогда 
		ПараметрОрганизация = Новый Структура("Организация", Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(Организация));
		
	ИначеЕсли ТипЗнч(Объекты) = Тип("Массив") И Объекты.Количество() > 0
		И ТипЗнч(Объекты[0]) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		ПараметрОрганизация = Новый Структура("Организация", 
			Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объекты[0], "Организация")));
			
	ИначеЕсли ТипЗнч(Объекты) = Тип("СправочникСсылка.ОсновныеСредства") 
		И ЗначениеЗаполнено(Объекты) Тогда
		ПараметрОрганизация = Новый Структура("Организация", 
		Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объекты, "Организация")));
		
	Иначе
		ПараметрОрганизация = Новый Структура(
		"Организация", Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(ОбщегоНазначенияБГУ.ТекущаяОрганизация()));
	КонецЕсли;
	Отчеты.ИнвентарнаяКарточка61н.УстановитьПараметрыДанных(КомпоновщикНастроек.Настройки, ПараметрОрганизация);
	Отчеты.ИнвентарнаяКарточка61н.ЗаполнитьОтветственногоИсполнителя(
	КомпоновщикНастроек.Настройки, ПараметрОрганизация.Организация.ЗначениеПараметра);
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере.
Процедура ПередЗагрузкойВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	
	СтруктураПараметровДанных = Новый Структура;
	Для Каждого ТекущийПараметр Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если ТекущийПараметр.Использование Тогда
			СтруктураПараметровДанных.Вставить(
				Строка(ТекущийПараметр.Параметр), Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(ТекущийПараметр.Значение));
		КонецЕсли;
	КонецЦикла;
	
	Отчеты.ИнвентарнаяКарточка61н.УстановитьПараметрыДанных(НовыеНастройкиКД, СтруктураПараметровДанных);
	
	ЭтоКонтекстныйВызов = Ложь;
	Если КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("ЭтоКонтекстныйВызов", ЭтоКонтекстныйВызов) Тогда
		НовыеНастройкиКД.ДополнительныеСвойства.Вставить("ЭтоКонтекстныйВызов", ЭтоКонтекстныйВызов);
	КонецЕсли;	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения СКД отчета.
//
// Параметры:
//   Контекст - Произвольный
//   КлючСхемы - Строка
//   КлючВарианта - Строка
//                - Неопределено
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных
//                    - Неопределено
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных
//                                    - Неопределено
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(
		Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
		
	ЭтоКонтекстныйВызов = Ложь;
	Если (КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("ЭтоКонтекстныйВызов", ЭтоКонтекстныйВызов) 
		ИЛИ НовыеНастройкиКД.ДополнительныеСвойства.Свойство("ЭтоКонтекстныйВызов", ЭтоКонтекстныйВызов))
		И ЭтоКонтекстныйВызов Тогда
		
		СтруктураПараметровДанных = Новый Структура;
		Для Каждого ТекущийПараметр Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
			Если ТекущийПараметр.Использование Тогда
				СтруктураПараметровДанных.Вставить(Строка(ТекущийПараметр.Параметр), 
				Отчеты.ИнвентарнаяКарточка61н.ПараметрДанных(ТекущийПараметр.Значение));
			КонецЕсли;
		КонецЦикла;
		
		Отчеты.ИнвентарнаяКарточка61н.УстановитьПараметрыДанных(НовыеНастройкиКД, СтруктураПараметровДанных, НовыеПользовательскиеНастройкиКД);
	КонецЕсли;	
	
	Если КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("ЭтоКонтекстныйВызов") Тогда
		КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ЭтоКонтекстныйВызов = Ложь;           
	КонецЕсли;	
	Если НовыеНастройкиКД.ДополнительныеСвойства.Свойство("ЭтоКонтекстныйВызов") Тогда
		НовыеНастройкиКД.ДополнительныеСвойства.ЭтоКонтекстныйВызов = Ложь;
	КонецЕсли;	
КонецПроцедуры 

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();

	ИсполняемыеНастройки = КомпоновщикНастроек.ПолучитьНастройки();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ИсполняемыеНастройки, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ТаблицаЗначений);
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ОтчетПустой = Результат.Количество() = 0;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетПустой", ОтчетПустой);

	// Запрос возвращает поля "Основное средство" и "Инвентарный номер", чтобы была возможность сортировки по 
	// инвентарному номеру. Для групповых ОС будет несколько строк 
	// Инвентарная карточка строится по объектам, поэтому таблицу нужно свернуть по объекту ОС
	Результат.Свернуть("ОсновноеСредство");
	
	МассивОбъектов = Новый Массив;
	Для Каждого ОбъектОС Из Результат Цикл
		МассивОбъектов.Добавить(ОбъектОС.ОсновноеСредство);
	КонецЦикла;
	
	ИменаФайловПечати = Новый Соответствие;
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыПечати = Новый Структура;   
	ПараметрПериод = ИсполняемыеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ПараметрПериод <> Неопределено Тогда
		ПараметрыПечати.Вставить("ДатаСведений", КонецДня(ПараметрПериод.Значение));
	КонецЕсли;	
	
	ПараметрОтветственныйИсполнитель = ИсполняемыеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("ОтветственныйИсполнитель"));
	Если ПараметрОтветственныйИсполнитель <> Неопределено 
		И ЗначениеЗаполнено(ПараметрОтветственныйИсполнитель.Значение) Тогда
		ПараметрыПечати.Вставить("Исполнитель", ПараметрОтветственныйИсполнитель.Значение);
	КонецЕсли;	
	
	ПараметрыПечати.Вставить("СворачиватьАмортизациюПрошлыхЛет", Ложь);
	ПараметрСворачиватьАмортизацию = ИсполняемыеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("СворачиватьАмортизациюПрошлыхЛет"));
	Если ПараметрСворачиватьАмортизацию <> Неопределено 
		И ПараметрСворачиватьАмортизацию.Значение <> Неопределено
		И ПараметрСворачиватьАмортизацию.Значение Тогда
		ПараметрыПечати.Вставить("СворачиватьАмортизациюПрошлыхЛет", ПараметрСворачиватьАмортизацию.Значение);
	КонецЕсли;	
	
	ТабДок = Справочники.ОсновныеСредства.ПечатьИнвентарнойКарточки61н(
		МассивОбъектов, ПараметрыПечати, ОбъектыПечати, ИменаФайловПечати);
		
	// ОбъектыПечати можно добавить в доп. свойства пользовательских настроек и они будут доступны в форме 
	// отчета после его формирования 	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОбъектыПечати", ОбъектыПечати);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить(
		"ПользовательскиеНастройкиМодифицированы", Истина);
	
	ДокументРезультат.Вывести(ТабДок);	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураДанныхДокумента()
	Возврат(Новый Структура("Дата, Организация, Объекты", 
		'00010101', Справочники.Организации.ПустаяСсылка(), Новый Массив));
КонецФункции	

Процедура ДанныеДокумента(Доки, ДанныеДокумента)
	Док = Документы.ПередачаОбъектовОС.ПустаяСсылка();
	Если ТипЗнч(Доки) = Тип("Массив") Тогда
		Док = Доки[0];
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Доки)) Тогда
		Док = Доки;
	КонецЕсли;	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТабЧасть.ОсновноеСредство КАК ОсновноеСредство,
	|	ТабЧасть.Ссылка.Дата КАК Дата,
	|	ТабЧасть.Ссылка.Организация КАК Организация
	|ИЗ
	|	&ВидДокумента КАК ТабЧасть
	|ГДЕ
	|	ТабЧасть.Ссылка = &Док
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабЧасть.ОсновноеСредство,
	|	ТабЧасть.Ссылка.Дата,
	|	ТабЧасть.Ссылка.Организация";
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, "&ВидДокумента", "Документ." + Док.Метаданные().Имя + ".ОсновныеСредства");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Док", Док);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ДанныеДокумента.Вставить("Объекты", Таблица.ВыгрузитьКолонку("ОсновноеСредство"));
	Если Таблица.Количество() <> 0 Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, Таблица[0], "Дата, Организация");
	КонецЕсли;	                                                
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
